young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_bootloader/libraries/drivers/inc/at32f422_426_gpio.h
/**
  **************************************************************************
  * @file     at32f422_426_gpio.h
  * @brief    at32f422_426 gpio header file
  **************************************************************************
  *
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/**
  porta iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1        |     mux2    |    mux3     |    mux4      |   mux5      |    mux6     |   mux7       |
  --------------------------------------------------------------------------------------------------------------------------------
  pa0          |             |  usart2_cts    |             |             |  i2c2_scl    |  tmr1_ext   |             |  cmp1_out   |
  --------------------------------------------------------------------------------------------------------------------------------
  pa1          |  eventout   |  usart2_rts_de |             |             |  i2c2_sda    |  tmr15_ch1c |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa2          |  tmr15_ch1  |  usart2_tx     |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa3          |  tmr15_ch2  |  usart2_rx     |             |             |              |  i2s2_mck   |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa4          |  spi1_cs    |  usart2_ck     |             |             |  tmr4_ch1    |             |   spi2_cs   |              |
               |  i2s1_ws    |                |             |             |              |             |   i2s2_ws   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa5          |  spi1_sck   |                |             |             |              |             |             |              |
               |  i2s1_ck    |                |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa6          |  spi1_miso  |  tmr3_ch1      |  tmr1_brk   |  i2s2_mck   |              |  tmr16_ch1  |  eventout   |  cmp1_out   |
               |  i2s1_mck   |                |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa7          |  spi1_mosi  |  tmr3_ch2      |  tmr1_ch1c  |             |  tmr4_ch1    |  tmr17_ch1  |  eventout   |              |
               |  i2s1_sd    |                |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa8          |  clkout     |  usart1_ck     |  tmr1_ch1   |   eventout  |  usart2_tx   |             |             |  i2c2_scl    |
  --------------------------------------------------------------------------------------------------------------------------------
  pa9          | tmr15_brk   |  usart1_tx     |  tmr1_ch2   |             |  i2c1_scl    |  clkout     |             |  i2c2_smba   |
  --------------------------------------------------------------------------------------------------------------------------------
  pa10         | tmr17_brk   |  usart1_rx     |  tmr1_ch3   |             |  i2c1_sda    |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa11         | eventout    | usart1_cts     |  tmr1_ch4   |             |  can1_rx     |  i2c2_scl   |  i2c1_smba  |  cmp1_out   |
  ----------------------------- --------------------------------------------------------------------------------------------------
  pa12         | eventout    | usart1_rts_de  |  tmr1_ext   |             |  can1_tx     |  i2c2_sda   |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa13         | swdio       |  ir_out        |             |             |              |             |   spi2_miso |              |
               |             |                |             |             |              |             |   i2s2_mck  |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa14         | swclk       |  usart2_tx     |             |             |              |             |   spi2_mosi |              |
               |             |                |             |             |              |             |   i2s2_sd   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa15         | spi1_cs     |  usart2_rx     |             |             |              |             |   spi2_cs   |              |
               | i2s1_ws     |                |             |  eventout   |              |             |   i2s2_ws   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  */

/**
  portb iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1      |     mux2    |    mux3     |    mux4      |   mux5      |    mux6     |   mux7        |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb0          |   eventout  |   tmr3_ch3   |   tmr1_ch2c |  usart2_rx  |              |             |  i2s1_mck   |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb1          |   tmr4_ch1  |   tmr3_ch4   |   tmr1_ch3c |             |              |             |  spi2_sck   |               |
               |             |              |             |             |              |             |  i2s2_ck    |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb2          |             |              |   tmr3_ext  |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb3          |   spi1_sck  |   eventout   |             |             |              |             |  spi2_sck   |  swo          |
               |   i2s1_ck   |              |             |             |              |             |  i2s2_ck    |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb4          |   spi1_miso |   tmr3_ch1   |   tmr1_ch4c |  eventout   |              | tmr17_brk   |  spi2_miso  |  i2c2_sda     |
               |   i2s1_mck  |              |             |             |              |             |  spi2_mck   |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb5          |   spi1_mosi |   tmr3_ch2   |  tmr16_brk  | i2c1_smba   |              |             |  spi2_mosi  |               |
               |   i2s1_sd   |              |             |             |              |             |  i2s2_sd    |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb6          |   usart1_tx |   i2c1_scl   |  tmr16_ch1c |             |              | tmr4_ch1    |  i2s1_mck   |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb7          |   usart1_rx |   i2c1_sda   |  tmr17_ch1c |             |   can1_stb   | tmr4_ch2    |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb8          |             |   i2c1_scl   |  tmr16_ch1  |             |   can1_rx    | tmr4_ch3    |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb9          |   ir_out    |   i2c1_sda   |  tmr17_ch1  |  eventout   |   can1_tx    | tmr4_ch4    |             |   spi2_cs     |
               |             |              |             |             |              |             |             |   i2s2_ws     |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb10         |             |   i2c2_scl   |             |             |              |             |             |   spi2_sck    |
               |             |              |             |             |              |             |             |   i2s2_ck     |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb11         |   eventout  |   i2c2_sda   |             |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb12         |   spi2_cs   |   eventout   |  tmr1_brk   |             |              |  tmr15_brk  |             |   i2c2_smba   |
               |   i2s2_ws   |              |             |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb13         |   spi2_sck  |              |  tmr1_ch1c  |             |              |  i2c2_scl   |             |               |
               |   i2s2_ck   |              |             |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb14         |   spi2_miso |  tmr15_ch1   |  tmr1_ch2c  |             |              |  i2c2_sda   |             |               |
               |   i2s2_mck  |              |             |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
  pb15         |   spi2_mosi |  tmr15_ch2   |  tmr1_ch3c  | tmr15_ch1c  |              |             |             |               |
               |   i2s2_sd   |              |             |             |              |             |             |               |
  -------------------------------------------------------------------------------------------------------------------------------- 
*/

/**
  portf iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1     |     mux2     |    mux3     |    mux4      |   mux5      |    mux6      |   mux7      |
  --------------------------------------------------------------------------------------------------------------------------------
  pf0          |             |   i2c1_sda  |   tmr1_ch1   |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf1          |             |   i2c1_scl  |   tmr1_ch2c  |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf2          |             |             |              |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf6          |  i2c2_scl   |             |              |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf7          |  i2c2_sda   |             |              |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf8          |             |             |              |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf11         |             |             |              |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
*/


/* define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F422_426_GPIO_H
#define __AT32F422_426_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif


